src/main/resources/wsdl/FedExFrieghtPriority.xml

<SOAP-ENV:Envelope
	xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:SOAPENC="http://schemas.xmlsoap.org/soap/encoding/"
	xmlns:xsi="http://www.w3.org/2001/XMLSchemainstance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns="http://fedex.com/ws/rate/v28">
    <SOAP-ENV:Body>
        <RateRequest>
            <WebAuthenticationDetail>
                <ParentCredential>
                    <Key>a0bRnbnp26tfOLsm</Key>
                    <Password>kGdcjfCEDPyQhBE1EySTcr6td</Password>
                </ParentCredential>
                <UserCredential>
                    <Key>a0bRnbnp26tfOLsm</Key>
                    <Password>kGdcjfCEDPyQhBE1EySTcr6td</Password>
                </UserCredential>
            </WebAuthenticationDetail>
            <ClientDetail>
                <AccountNumber>510087780</AccountNumber>
                <MeterNumber>100717433</MeterNumber>
            </ClientDetail>
            <TransactionDetail>
                <CustomerTransactionId>RateRequest_v28</CustomerTransactionId>
            </TransactionDetail>
            <Version>
                <ServiceId>crs</ServiceId>
                <Major>28</Major>
                <Intermediate>0</Intermediate>
                <Minor>0</Minor>
            </Version>
            <RequestedShipment>
                <ShipTimestamp>2021-09-27T12:34:56-06:00</ShipTimestamp>
                <DropoffType>REGULAR_PICKUP</DropoffType>
                <ServiceType>FEDEX_FREIGHT_PRIORITY</ServiceType>
                <PackagingType>YOUR_PACKAGING</PackagingType>
                <TotalWeight>
                    <Units>LB</Units>
                    <Value>151.0</Value>
                </TotalWeight>
                <PreferredCurrency>USD</PreferredCurrency>
                <Shipper>
                    <AccountNumber>510087780</AccountNumber>
                    <Contact>
                        <CompanyName>Company ABC</CompanyName>
                    </Contact>
                    <Address>
                        <StreetLines>1202 Chalet Ln</StreetLines>
                        <StreetLines>Do Not Delete - Test Account</StreetLines>
                        <City>Harrison</City>
                        <StateOrProvinceCode>AR</StateOrProvinceCode>
                        <PostalCode>72601</PostalCode>
                        <CountryCode>US</CountryCode>
                    </Address>
                </Shipper>
                <Recipient>
                    <AccountNumber>510087780</AccountNumber>
                    <Contact>
                        <PersonName>Omkar</PersonName>
                    </Contact>
                    <Address>
                        <StreetLines>5700 Lombardo Ctr</StreetLines>
                        <StreetLines>Ste 201</StreetLines>
                        <City>Seven Hills</City>
                        <StateOrProvinceCode>OH</StateOrProvinceCode>
                        <PostalCode>44241</PostalCode>
                        <CountryCode>US</CountryCode>
                    </Address>
                </Recipient>
                <ShippingChargesPayment>
                    <PaymentType>SENDER</PaymentType>
                    <Payor>
                        <ResponsibleParty>
                            <AccountNumber>510087020</AccountNumber>
                        </ResponsibleParty>
                    </Payor>
                </ShippingChargesPayment>
                <FreightShipmentDetail>
                    <FedExFreightAccountNumber>510087020</FedExFreightAccountNumber>
                    <FedExFreightBillingContactAndAddress>
                        <Contact>
                            <PersonName>Omkar</PersonName>
                        </Contact>
                        <Address>
                            <StreetLines>2000 Freight LTL Testing</StreetLines>
                            <StreetLines>Do Not Delete - Test Account</StreetLines>
                            <City>Harrison</City>
                            <StateOrProvinceCode>AR</StateOrProvinceCode>
                            <PostalCode>72601</PostalCode>
                            <CountryCode>US</CountryCode>
                        </Address>
                    </FedExFreightBillingContactAndAddress>
                    <Role>SHIPPER</Role>
                    <LineItems>
                        <Id>1</Id>
                        <FreightClass>CLASS_085</FreightClass>
                        <Packaging>PIECE</Packaging>
                        <Pieces>1</Pieces>
                        <Description>Test</Description>
                        <Weight>
                            <Units>LB</Units>
                            <Value>151.0</Value>
                        </Weight>
                    </LineItems>
                    <LineItems>
                        <Id>2</Id>
                        <FreightClass>CLASS_085</FreightClass>
                        <Packaging>PIECE</Packaging>
                        <Pieces>1</Pieces>
                        <Description>Test</Description>
                        <Weight>
                            <Units>LB</Units>
                            <Value>151.0</Value>
                        </Weight>
                    </LineItems>
                 </FreightShipmentDetail>
                <RateRequestTypes>LIST</RateRequestTypes>
                <PackageCount>1</PackageCount>
                <RequestedPackageLineItems>
                    <SequenceNumber>1</SequenceNumber>
                    <GroupNumber>1</GroupNumber>
                    <GroupPackageCount>1</GroupPackageCount>
                    <Weight>
                        <Units>LB</Units>
                        <Value>151.0</Value>
                    </Weight>
                    <PhysicalPackaging>PIECE</PhysicalPackaging>
                    <AssociatedFreightLineItems>
                        <Id>1</Id>
                    </AssociatedFreightLineItems>    
                </RequestedPackageLineItems>
                <RequestedPackageLineItems>
                    <SequenceNumber>2</SequenceNumber>
                    <GroupNumber>1</GroupNumber>
                    <GroupPackageCount>1</GroupPackageCount>
                    <Weight>
                        <Units>LB</Units>
                        <Value>151.0</Value>
                    </Weight>
                    <PhysicalPackaging>PIECE</PhysicalPackaging>
                    <AssociatedFreightLineItems>
                        <Id>1</Id>
                    </AssociatedFreightLineItems>    
                </RequestedPackageLineItems>
            </RequestedShipment>
        </RateRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>